import { env } from '@/env';
import { escapeMarkdown } from '@/utils/escapeMarkdown';

export const MENU_MESSAGE = `
Привет 👋, я Пиксельный Кубик!\nЯ помогу тебе попасть на сервер, но перед этим нужно подписаться на канал ${env.TELEGRAM_SUB_CHANNEL}
`;

export const WHITELIST_MESSAGE = `🎉 Никнейм успешно добавлен в вайтлист, приятной игры 😊 \n\nIP: \`${escapeMarkdown(env.SERVER_IP_PORT)}\` \\(нажмите, чтобы скопировать\\) \n\n${env.WELCOME_MESSAGE}`;

export const NOT_AVAILABLE_BOT_MESSAGE = '❌ Упс! Бот упал и не может корректно обрабатывать запросы, повторите позже.';

export const BANNED_PLAYER_MESSAGE =
  '🥲 Проблема в том, что ты попал в бан, к сожалению ты удалён из вайтлиста и больше не можешь добавлять новые ники\\.';
